server17/mediaMicroservices/wrk2/two_choice_compose_output.txt
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.24ms    2.15ms  14.06ms   89.63%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.59ms
 75.000%    5.79ms
 90.000%    7.56ms
 99.000%   14.06ms
 99.900%   21.74ms
 99.990%   23.09ms
 99.999%   23.09ms
100.000%   23.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.141     0.000000            1         1.00
       3.657     0.100000          201         1.11
       3.839     0.200000          398         1.25
       4.053     0.300000          598         1.43
       4.323     0.400000          795         1.67
       4.595     0.500000          995         2.00
       4.755     0.550000         1093         2.22
       4.927     0.600000         1193         2.50
       5.111     0.650000         1292         2.86
       5.403     0.700000         1392         3.33
       5.795     0.750000         1491         4.00
       5.983     0.775000         1541         4.44
       6.143     0.800000         1591         5.00
       6.347     0.825000         1640         5.71
       6.615     0.850000         1689         6.67
       7.007     0.875000         1739         8.00
       7.239     0.887500         1764         8.89
       7.567     0.900000         1789        10.00
       7.887     0.912500         1814        11.43
       8.255     0.925000         1838        13.33
       8.743     0.937500         1863        16.00
       9.055     0.943750         1876        17.78
       9.255     0.950000         1889        20.00
       9.519     0.956250         1901        22.86
       9.815     0.962500         1913        26.67
      10.311     0.968750         1925        32.00
      10.655     0.971875         1932        35.56
      11.039     0.975000         1938        40.00
      11.175     0.978125         1944        45.71
      11.375     0.981250         1950        53.33
      11.759     0.984375         1956        64.00
      12.727     0.985938         1960        71.11
      13.039     0.987500         1963        80.00
      14.023     0.989062         1966        91.43
      14.807     0.990625         1969       106.67
      15.511     0.992188         1972       128.00
      16.263     0.992969         1974       142.22
      16.375     0.993750         1975       160.00
      16.511     0.994531         1977       182.86
      18.399     0.995313         1978       213.33
      19.247     0.996094         1980       256.00
      19.503     0.996484         1981       284.44
      19.503     0.996875         1981       320.00
      20.111     0.997266         1982       365.71
      20.319     0.997656         1983       426.67
      21.375     0.998047         1984       512.00
      21.375     0.998242         1984       568.89
      21.375     0.998437         1984       640.00
      21.743     0.998633         1985       731.43
      21.743     0.998828         1985       853.33
      22.383     0.999023         1986      1024.00
      22.383     0.999121         1986      1137.78
      22.383     0.999219         1986      1280.00
      22.383     0.999316         1986      1462.86
      22.383     0.999414         1986      1706.67
      23.087     0.999512         1987      2048.00
      23.087     1.000000         1987          inf
#[Mean    =        5.245, StdDeviation   =        2.152]
#[Max     =       23.072, Total count    =         1987]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1988 requests in 10.00s, 702.79KB read
  Socket errors: connect 0, read 0, write 0, timeout 5
  Non-2xx or 3xx responses: 1988
Requests/sec:    198.74
Transfer/sec:     70.26KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.01ms    2.85ms  17.82ms   88.34%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.08ms
 75.000%    6.78ms
 90.000%    9.26ms
 99.000%   17.82ms
 99.900%   23.23ms
 99.990%   29.90ms
 99.999%   29.90ms
100.000%   29.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.135     0.000000            1         1.00
       3.779     0.100000          299         1.11
       4.087     0.200000          597         1.25
       4.403     0.300000          897         1.43
       4.695     0.400000         1194         1.67
       5.083     0.500000         1489         2.00
       5.343     0.550000         1639         2.22
       5.607     0.600000         1787         2.50
       5.943     0.650000         1937         2.86
       6.343     0.700000         2084         3.33
       6.775     0.750000         2233         4.00
       7.023     0.775000         2308         4.44
       7.279     0.800000         2382         5.00
       7.651     0.825000         2458         5.71
       8.079     0.850000         2531         6.67
       8.567     0.875000         2607         8.00
       8.951     0.887500         2643         8.89
       9.263     0.900000         2680        10.00
       9.639     0.912500         2717        11.43
       9.951     0.925000         2754        13.33
      10.487     0.937500         2791        16.00
      10.983     0.943750         2811        17.78
      11.503     0.950000         2829        20.00
      11.975     0.956250         2847        22.86
      12.559     0.962500         2867        26.67
      13.199     0.968750         2884        32.00
      13.719     0.971875         2894        35.56
      14.031     0.975000         2903        40.00
      14.911     0.978125         2912        45.71
      15.455     0.981250         2922        53.33
      16.023     0.984375         2931        64.00
      16.495     0.985938         2936        71.11
      17.007     0.987500         2940        80.00
      17.391     0.989062         2945        91.43
      18.207     0.990625         2950       106.67
      18.703     0.992188         2954       128.00
      19.583     0.992969         2957       142.22
      19.631     0.993750         2959       160.00
      20.223     0.994531         2961       182.86
      21.455     0.995313         2964       213.33
      21.983     0.996094         2966       256.00
      22.031     0.996484         2967       284.44
      22.207     0.996875         2968       320.00
      22.335     0.997266         2969       365.71
      22.527     0.997656         2972       426.67
      22.527     0.998047         2972       512.00
      22.527     0.998242         2972       568.89
      22.911     0.998437         2973       640.00
      22.911     0.998633         2973       731.43
      23.231     0.998828         2974       853.33
      28.255     0.999023         2975      1024.00
      28.255     0.999121         2975      1137.78
      28.255     0.999219         2975      1280.00
      28.255     0.999316         2975      1462.86
      29.263     0.999414         2976      1706.67
      29.263     0.999512         2976      2048.00
      29.263     0.999561         2976      2275.56
      29.263     0.999609         2976      2560.00
      29.263     0.999658         2976      2925.71
      29.903     0.999707         2977      3413.33
      29.903     1.000000         2977          inf
#[Mean    =        6.011, StdDeviation   =        2.852]
#[Max     =       29.888, Total count    =         2977]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2978 requests in 10.00s, 1.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 2978
Requests/sec:    297.81
Transfer/sec:    105.28KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.02ms    3.93ms  22.64ms   88.26%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.77ms
 75.000%    8.07ms
 90.000%   11.63ms
 99.000%   22.64ms
 99.900%   32.65ms
 99.990%   47.42ms
 99.999%   47.42ms
100.000%   47.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.047     0.000000            1         1.00
       3.927     0.100000          397         1.11
       4.331     0.200000          794         1.25
       4.707     0.300000         1195         1.43
       5.183     0.400000         1588         1.67
       5.771     0.500000         1985         2.00
       6.111     0.550000         2184         2.22
       6.519     0.600000         2381         2.50
       6.903     0.650000         2580         2.86
       7.407     0.700000         2778         3.33
       8.071     0.750000         2977         4.00
       8.439     0.775000         3077         4.44
       8.871     0.800000         3176         5.00
       9.495     0.825000         3274         5.71
      10.039     0.850000         3375         6.67
      10.671     0.875000         3472         8.00
      11.143     0.887500         3524         8.89
      11.631     0.900000         3573        10.00
      12.223     0.912500         3621        11.43
      12.927     0.925000         3671        13.33
      13.671     0.937500         3721        16.00
      14.103     0.943750         3745        17.78
      14.631     0.950000         3770        20.00
      15.119     0.956250         3795        22.86
      15.975     0.962500         3820        26.67
      16.831     0.968750         3844        32.00
      17.519     0.971875         3858        35.56
      17.871     0.975000         3869        40.00
      18.335     0.978125         3883        45.71
      19.199     0.981250         3894        53.33
      20.591     0.984375         3906        64.00
      20.879     0.985938         3913        71.11
      21.471     0.987500         3919        80.00
      22.143     0.989062         3925        91.43
      22.991     0.990625         3932       106.67
      24.639     0.992188         3937       128.00
      24.879     0.992969         3941       142.22
      25.167     0.993750         3944       160.00
      26.399     0.994531         3947       182.86
      26.527     0.995313         3950       213.33
      27.423     0.996094         3953       256.00
      29.151     0.996484         3955       284.44
      29.807     0.996875         3956       320.00
      31.087     0.997266         3958       365.71
      31.567     0.997656         3959       426.67
      32.367     0.998047         3961       512.00
      32.383     0.998242         3962       568.89
      32.383     0.998437         3962       640.00
      32.463     0.998633         3963       731.43
      32.655     0.998828         3964       853.33
      33.855     0.999023         3965      1024.00
      33.855     0.999121         3965      1137.78
      33.855     0.999219         3965      1280.00
      34.911     0.999316         3966      1462.86
      34.911     0.999414         3966      1706.67
      35.039     0.999512         3967      2048.00
      35.039     0.999561         3967      2275.56
      35.039     0.999609         3967      2560.00
      35.039     0.999658         3967      2925.71
      35.039     0.999707         3967      3413.33
      47.423     0.999756         3968      4096.00
      47.423     1.000000         3968          inf
#[Mean    =        7.025, StdDeviation   =        3.934]
#[Max     =       47.392, Total count    =         3968]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3969 requests in 10.00s, 1.37MB read
  Non-2xx or 3xx responses: 3969
Requests/sec:    396.91
Transfer/sec:    140.32KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.90ms    4.37ms  23.17ms   85.83%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.66ms
 75.000%    9.45ms
 90.000%   13.33ms
 99.000%   23.17ms
 99.900%   35.94ms
 99.990%   73.54ms
 99.999%   73.54ms
100.000%   73.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.045     0.000000            1         1.00
       4.167     0.100000          498         1.11
       4.631     0.200000          990         1.25
       5.163     0.300000         1486         1.43
       5.875     0.400000         1979         1.67
       6.655     0.500000         2475         2.00
       7.071     0.550000         2721         2.22
       7.511     0.600000         2968         2.50
       8.051     0.650000         3217         2.86
       8.703     0.700000         3463         3.33
       9.447     0.750000         3711         4.00
       9.847     0.775000         3835         4.44
      10.311     0.800000         3958         5.00
      10.927     0.825000         4082         5.71
      11.559     0.850000         4206         6.67
      12.503     0.875000         4328         8.00
      12.855     0.887500         4391         8.89
      13.327     0.900000         4452        10.00
      13.855     0.912500         4515        11.43
      14.495     0.925000         4576        13.33
      14.999     0.937500         4637        16.00
      15.455     0.943750         4668        17.78
      15.927     0.950000         4699        20.00
      16.655     0.956250         4730        22.86
      17.503     0.962500         4761        26.67
      18.559     0.968750         4792        32.00
      19.119     0.971875         4808        35.56
      19.663     0.975000         4823        40.00
      20.159     0.978125         4839        45.71
      20.735     0.981250         4854        53.33
      21.167     0.984375         4869        64.00
      21.551     0.985938         4877        71.11
      21.839     0.987500         4885        80.00
      22.623     0.989062         4892        91.43
      23.551     0.990625         4900       106.67
      24.319     0.992188         4908       128.00
      24.687     0.992969         4912       142.22
      26.063     0.993750         4916       160.00
      26.319     0.994531         4919       182.86
      28.431     0.995313         4923       213.33
      29.039     0.996094         4927       256.00
      29.407     0.996484         4929       284.44
      30.399     0.996875         4931       320.00
      30.591     0.997266         4933       365.71
      31.407     0.997656         4935       426.67
      32.415     0.998047         4937       512.00
      33.759     0.998242         4938       568.89
      34.207     0.998437         4939       640.00
      34.527     0.998633         4940       731.43
      35.935     0.998828         4941       853.33
      40.831     0.999023         4942      1024.00
      40.831     0.999121         4942      1137.78
      43.775     0.999219         4943      1280.00
      43.775     0.999316         4943      1462.86
      44.415     0.999414         4944      1706.67
      44.415     0.999512         4944      2048.00
      44.415     0.999561         4944      2275.56
      44.863     0.999609         4945      2560.00
      44.863     0.999658         4945      2925.71
      44.863     0.999707         4945      3413.33
      44.863     0.999756         4945      4096.00
      44.863     0.999780         4945      4551.11
      73.535     0.999805         4946      5120.00
      73.535     1.000000         4946          inf
#[Mean    =        7.896, StdDeviation   =        4.371]
#[Max     =       73.472, Total count    =         4946]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4947 requests in 10.00s, 1.71MB read
  Non-2xx or 3xx responses: 4947
Requests/sec:    494.70
Transfer/sec:    174.88KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.43ms    5.92ms  30.88ms   79.99%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.63ms
 75.000%   13.24ms
 90.000%   18.25ms
 99.000%   30.88ms
 99.900%   40.90ms
 99.990%   46.94ms
 99.999%   47.04ms
100.000%   47.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.211     0.000000            1         1.00
       4.835     0.100000          595         1.11
       5.599     0.200000         1191         1.25
       6.527     0.300000         1786         1.43
       7.515     0.400000         2380         1.67
       8.631     0.500000         2973         2.00
       9.351     0.550000         3273         2.22
      10.127     0.600000         3571         2.50
      11.047     0.650000         3866         2.86
      12.031     0.700000         4165         3.33
      13.239     0.750000         4460         4.00
      13.823     0.775000         4609         4.44
      14.455     0.800000         4758         5.00
      15.231     0.825000         4906         5.71
      16.095     0.850000         5055         6.67
      17.119     0.875000         5204         8.00
      17.599     0.887500         5279         8.89
      18.255     0.900000         5353        10.00
      18.975     0.912500         5426        11.43
      19.871     0.925000         5501        13.33
      21.023     0.937500         5575        16.00
      21.647     0.943750         5612        17.78
      22.399     0.950000         5649        20.00
      22.991     0.956250         5686        22.86
      24.015     0.962500         5725        26.67
      24.959     0.968750         5761        32.00
      25.615     0.971875         5779        35.56
      26.319     0.975000         5798        40.00
      26.927     0.978125         5816        45.71
      27.903     0.981250         5835        53.33
      29.167     0.984375         5854        64.00
      29.551     0.985938         5863        71.11
      30.175     0.987500         5872        80.00
      30.671     0.989062         5881        91.43
      31.135     0.990625         5891       106.67
      31.887     0.992188         5900       128.00
      32.527     0.992969         5905       142.22
      32.863     0.993750         5909       160.00
      33.823     0.994531         5914       182.86
      34.367     0.995313         5919       213.33
      34.815     0.996094         5923       256.00
      35.327     0.996484         5926       284.44
      35.455     0.996875         5928       320.00
      36.063     0.997266         5930       365.71
      36.511     0.997656         5933       426.67
      37.439     0.998047         5936       512.00
      37.439     0.998242         5936       568.89
      37.887     0.998437         5937       640.00
      37.983     0.998633         5938       731.43
      40.895     0.998828         5940       853.33
      41.055     0.999023         5941      1024.00
      41.055     0.999121         5941      1137.78
      41.119     0.999219         5942      1280.00
      41.119     0.999316         5942      1462.86
      43.327     0.999414         5943      1706.67
      44.863     0.999512         5944      2048.00
      44.863     0.999561         5944      2275.56
      44.863     0.999609         5944      2560.00
      44.863     0.999658         5944      2925.71
      46.943     0.999707         5945      3413.33
      46.943     0.999756         5945      4096.00
      46.943     0.999780         5945      4551.11
      46.943     0.999805         5945      5120.00
      46.943     0.999829         5945      5851.43
      47.039     0.999854         5946      6826.67
      47.039     1.000000         5946          inf
#[Mean    =       10.429, StdDeviation   =        5.915]
#[Max     =       47.008, Total count    =         5946]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5947 requests in 10.00s, 2.05MB read
  Non-2xx or 3xx responses: 5947
Requests/sec:    594.67
Transfer/sec:    210.23KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.23ms    7.89ms  39.71ms   76.20%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.04ms
 75.000%   16.90ms
 90.000%   24.11ms
 99.000%   39.71ms
 99.900%   56.22ms
 99.990%   66.75ms
 99.999%   69.44ms
100.000%   69.44ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.161     0.000000            1         1.00
       5.459     0.100000          692         1.11
       6.827     0.200000         1384         1.25
       8.035     0.300000         2076         1.43
       9.487     0.400000         2766         1.67
      11.039     0.500000         3457         2.00
      12.039     0.550000         3803         2.22
      13.063     0.600000         4148         2.50
      14.103     0.650000         4496         2.86
      15.271     0.700000         4840         3.33
      16.895     0.750000         5184         4.00
      17.727     0.775000         5357         4.44
      18.623     0.800000         5532         5.00
      19.823     0.825000         5704         5.71
      20.895     0.850000         5876         6.67
      22.463     0.875000         6048         8.00
      23.215     0.887500         6135         8.89
      24.111     0.900000         6220        10.00
      25.215     0.912500         6308        11.43
      26.223     0.925000         6394        13.33
      27.407     0.937500         6480        16.00
      28.031     0.943750         6523        17.78
      28.687     0.950000         6566        20.00
      29.503     0.956250         6609        22.86
      30.335     0.962500         6652        26.67
      31.711     0.968750         6696        32.00
      32.415     0.971875         6718        35.56
      33.023     0.975000         6740        40.00
      33.951     0.978125         6760        45.71
      34.879     0.981250         6782        53.33
      36.607     0.984375         6804        64.00
      37.599     0.985938         6815        71.11
      37.983     0.987500         6825        80.00
      39.007     0.989062         6836        91.43
      40.991     0.990625         6847       106.67
      41.919     0.992188         6858       128.00
      42.111     0.992969         6863       142.22
      43.071     0.993750         6868       160.00
      44.575     0.994531         6874       182.86
      45.535     0.995313         6879       213.33
      46.367     0.996094         6885       256.00
      47.455     0.996484         6887       284.44
      48.255     0.996875         6890       320.00
      48.703     0.997266         6893       365.71
      49.567     0.997656         6895       426.67
      50.527     0.998047         6898       512.00
      50.687     0.998242         6899       568.89
      52.223     0.998437         6901       640.00
      53.663     0.998633         6902       731.43
      54.463     0.998828         6903       853.33
      57.407     0.999023         6905      1024.00
      57.407     0.999121         6905      1137.78
      57.855     0.999219         6906      1280.00
      58.079     0.999316         6907      1462.86
      58.079     0.999414         6907      1706.67
      60.159     0.999512         6908      2048.00
      60.159     0.999561         6908      2275.56
      60.255     0.999609         6909      2560.00
      60.255     0.999658         6909      2925.71
      60.255     0.999707         6909      3413.33
      66.751     0.999756         6910      4096.00
      66.751     0.999780         6910      4551.11
      66.751     0.999805         6910      5120.00
      66.751     0.999829         6910      5851.43
      66.751     0.999854         6910      6826.67
      69.439     0.999878         6911      8192.00
      69.439     1.000000         6911          inf
#[Mean    =       13.231, StdDeviation   =        7.892]
#[Max     =       69.376, Total count    =         6911]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6912 requests in 10.00s, 2.39MB read
  Non-2xx or 3xx responses: 6912
Requests/sec:    691.13
Transfer/sec:    244.33KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.66ms   34.20ms 177.41ms   96.60%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.65ms
 75.000%   15.74ms
 90.000%   25.73ms
 99.000%  177.41ms
 99.900%  395.26ms
 99.990%  817.15ms
 99.999%  823.29ms
100.000%  823.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.171     0.000000            1         1.00
       0.344     0.100000          792         1.11
       0.609     0.200000         1583         1.25
       1.363     0.300000         2372         1.43
       6.355     0.400000         3164         1.67
       8.647     0.500000         3953         2.00
       9.943     0.550000         4349         2.22
      11.135     0.600000         4746         2.50
      12.487     0.650000         5139         2.86
      14.007     0.700000         5535         3.33
      15.743     0.750000         5929         4.00
      16.831     0.775000         6129         4.44
      18.063     0.800000         6326         5.00
      19.471     0.825000         6522         5.71
      21.103     0.850000         6721         6.67
      23.263     0.875000         6919         8.00
      24.431     0.887500         7016         8.89
      25.727     0.900000         7116        10.00
      27.503     0.912500         7214        11.43
      29.775     0.925000         7313        13.33
      32.063     0.937500         7411        16.00
      34.143     0.943750         7461        17.78
      37.023     0.950000         7511        20.00
      40.927     0.956250         7560        22.86
      45.663     0.962500         7609        26.67
      54.527     0.968750         7658        32.00
      59.871     0.971875         7683        35.56
      68.799     0.975000         7709        40.00
      81.215     0.978125         7733        45.71
     101.823     0.981250         7757        53.33
     129.727     0.984375         7782        64.00
     143.359     0.985938         7794        71.11
     152.959     0.987500         7807        80.00
     166.655     0.989062         7819        91.43
     182.783     0.990625         7831       106.67
     209.279     0.992188         7844       128.00
     225.151     0.992969         7850       142.22
     235.007     0.993750         7856       160.00
     252.799     0.994531         7862       182.86
     266.751     0.995313         7868       213.33
     286.719     0.996094         7875       256.00
     295.679     0.996484         7878       284.44
     304.127     0.996875         7881       320.00
     328.959     0.997266         7884       365.71
     349.439     0.997656         7887       426.67
     362.239     0.998047         7890       512.00
     376.319     0.998242         7892       568.89
     379.903     0.998437         7893       640.00
     381.439     0.998633         7895       731.43
     387.071     0.998828         7896       853.33
     396.031     0.999023         7898      1024.00
     396.543     0.999121         7899      1137.78
     396.543     0.999219         7899      1280.00
     402.943     0.999316         7900      1462.86
     414.975     0.999414         7901      1706.67
     452.863     0.999512         7902      2048.00
     452.863     0.999561         7902      2275.56
     452.863     0.999609         7902      2560.00
     484.607     0.999658         7903      2925.71
     484.607     0.999707         7903      3413.33
     817.151     0.999756         7904      4096.00
     817.151     0.999780         7904      4551.11
     817.151     0.999805         7904      5120.00
     817.151     0.999829         7904      5851.43
     817.151     0.999854         7904      6826.67
     823.295     0.999878         7905      8192.00
     823.295     1.000000         7905          inf
#[Mean    =       14.663, StdDeviation   =       34.198]
#[Max     =      822.784, Total count    =         7905]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7907 requests in 10.00s, 2.72MB read
  Non-2xx or 3xx responses: 7907
Requests/sec:    790.67
Transfer/sec:    278.13KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    53.74ms  113.21ms 535.55ms   88.44%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.88ms
 75.000%   54.91ms
 90.000%  188.93ms
 99.000%  535.55ms
 99.900%  868.35ms
 99.990%    1.07s 
 99.999%    1.11s 
100.000%    1.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.170     0.000000            1         1.00
       0.268     0.100000          883         1.11
       0.382     0.200000         1768         1.25
       0.521     0.300000         2647         1.43
       0.667     0.400000         3535         1.67
       0.881     0.500000         4412         2.00
       1.026     0.550000         4854         2.22
       1.397     0.600000         5295         2.50
       4.467     0.650000         5735         2.86
      27.455     0.700000         6177         3.33
      54.911     0.750000         6618         4.00
      69.695     0.775000         6838         4.44
      87.871     0.800000         7059         5.00
     107.711     0.825000         7280         5.71
     130.239     0.850000         7500         6.67
     155.519     0.875000         7721         8.00
     170.879     0.887500         7831         8.89
     188.927     0.900000         7941        10.00
     209.919     0.912500         8051        11.43
     234.495     0.925000         8162        13.33
     259.071     0.937500         8272        16.00
     270.847     0.943750         8327        17.78
     288.767     0.950000         8382        20.00
     308.223     0.956250         8437        22.86
     329.727     0.962500         8493        26.67
     355.583     0.968750         8548        32.00
     370.943     0.971875         8575        35.56
     386.559     0.975000         8603        40.00
     403.455     0.978125         8631        45.71
     430.079     0.981250         8658        53.33
     455.423     0.984375         8686        64.00
     478.207     0.985938         8699        71.11
     496.639     0.987500         8713        80.00
     519.423     0.989062         8727        91.43
     552.447     0.990625         8741       106.67
     587.263     0.992188         8755       128.00
     609.279     0.992969         8761       142.22
     622.079     0.993750         8768       160.00
     642.047     0.994531         8775       182.86
     658.431     0.995313         8782       213.33
     677.887     0.996094         8789       256.00
     713.215     0.996484         8792       284.44
     733.695     0.996875         8796       320.00
     746.495     0.997266         8799       365.71
     761.343     0.997656         8803       426.67
     775.679     0.998047         8806       512.00
     793.599     0.998242         8808       568.89
     806.911     0.998437         8810       640.00
     816.127     0.998633         8811       731.43
     858.111     0.998828         8813       853.33
     869.375     0.999023         8815      1024.00
     872.447     0.999121         8816      1137.78
     912.895     0.999219         8817      1280.00
     912.895     0.999316         8817      1462.86
     925.695     0.999414         8818      1706.67
     930.815     0.999512         8819      2048.00
     934.911     0.999561         8820      2275.56
     934.911     0.999609         8820      2560.00
     934.911     0.999658         8820      2925.71
     980.479     0.999707         8821      3413.33
     980.479     0.999756         8821      4096.00
    1068.031     0.999780         8822      4551.11
    1068.031     0.999805         8822      5120.00
    1068.031     0.999829         8822      5851.43
    1068.031     0.999854         8822      6826.67
    1068.031     0.999878         8822      8192.00
    1111.039     0.999890         8823      9102.22
    1111.039     1.000000         8823          inf
#[Mean    =       53.742, StdDeviation   =      113.209]
#[Max     =     1110.016, Total count    =         8823]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8824 requests in 10.00s, 3.00MB read
  Non-2xx or 3xx responses: 8824
Requests/sec:    882.45
Transfer/sec:    307.65KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    58.17ms  114.01ms 528.38ms   87.57%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%   67.52ms
 90.000%  202.49ms
 99.000%  528.38ms
 99.900%  799.74ms
 99.990%  924.67ms
 99.999%  979.97ms
100.000%  979.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.177     0.000000            1         1.00
       0.286     0.100000          975         1.11
       0.438     0.200000         1958         1.25
       0.586     0.300000         2930         1.43
       0.768     0.400000         3899         1.67
       1.051     0.500000         4872         2.00
       1.385     0.550000         5359         2.22
       2.747     0.600000         5846         2.50
      19.519     0.650000         6333         2.86
      42.783     0.700000         6820         3.33
      67.519     0.750000         7308         4.00
      82.943     0.775000         7551         4.44
     101.119     0.800000         7797         5.00
     120.191     0.825000         8040         5.71
     142.207     0.850000         8281         6.67
     171.007     0.875000         8525         8.00
     187.775     0.887500         8647         8.89
     202.495     0.900000         8768        10.00
     222.335     0.912500         8890        11.43
     239.743     0.925000         9012        13.33
     265.727     0.937500         9134        16.00
     278.783     0.943750         9195        17.78
     295.679     0.950000         9255        20.00
     315.903     0.956250         9316        22.86
     335.871     0.962500         9377        26.67
     362.495     0.968750         9438        32.00
     382.975     0.971875         9469        35.56
     397.055     0.975000         9499        40.00
     414.975     0.978125         9529        45.71
     442.111     0.981250         9561        53.33
     471.039     0.984375         9590        64.00
     489.471     0.985938         9606        71.11
     502.783     0.987500         9621        80.00
     517.631     0.989062         9636        91.43
     539.135     0.990625         9652       106.67
     567.295     0.992188         9666       128.00
     584.703     0.992969         9674       142.22
     608.767     0.993750         9682       160.00
     626.687     0.994531         9689       182.86
     648.703     0.995313         9697       213.33
     671.231     0.996094         9704       256.00
     687.103     0.996484         9708       284.44
     707.071     0.996875         9712       320.00
     741.375     0.997266         9716       365.71
     763.391     0.997656         9720       426.67
     766.463     0.998047         9723       512.00
     774.143     0.998242         9726       568.89
     774.655     0.998437         9727       640.00
     781.823     0.998633         9729       731.43
     795.647     0.998828         9731       853.33
     812.031     0.999023         9733      1024.00
     825.855     0.999121         9734      1137.78
     837.631     0.999219         9735      1280.00
     841.727     0.999316         9736      1462.86
     865.791     0.999414         9737      1706.67
     886.271     0.999512         9738      2048.00
     886.271     0.999561         9738      2275.56
     911.359     0.999609         9739      2560.00
     911.359     0.999658         9739      2925.71
     916.479     0.999707         9740      3413.33
     916.479     0.999756         9740      4096.00
     916.479     0.999780         9740      4551.11
     924.671     0.999805         9741      5120.00
     924.671     0.999829         9741      5851.43
     924.671     0.999854         9741      6826.67
     924.671     0.999878         9741      8192.00
     924.671     0.999890         9741      9102.22
     979.967     0.999902         9742     10240.00
     979.967     1.000000         9742          inf
#[Mean    =       58.172, StdDeviation   =      114.010]
#[Max     =      979.456, Total count    =         9742]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9743 requests in 10.00s, 3.32MB read
  Non-2xx or 3xx responses: 9743
Requests/sec:    974.40
Transfer/sec:    339.71KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    67.85ms  115.32ms 514.30ms   86.85%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.78ms
 75.000%   98.11ms
 90.000%  219.13ms
 99.000%  514.30ms
 99.900%  857.60ms
 99.990%  969.22ms
 99.999%    1.22s 
100.000%    1.22s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.171     0.000000            1         1.00
       0.334     0.100000         1074         1.11
       0.531     0.200000         2148         1.25
       0.713     0.300000         3212         1.43
       0.961     0.400000         4285         1.67
       1.776     0.500000         5352         2.00
       9.407     0.550000         5887         2.22
      28.111     0.600000         6422         2.50
      48.383     0.650000         6957         2.86
      70.911     0.700000         7493         3.33
      98.175     0.750000         8029         4.00
     112.511     0.775000         8295         4.44
     129.087     0.800000         8563         5.00
     148.223     0.825000         8830         5.71
     168.063     0.850000         9098         6.67
     191.487     0.875000         9366         8.00
     203.519     0.887500         9499         8.89
     219.135     0.900000         9633        10.00
     236.543     0.912500         9768        11.43
     256.639     0.925000         9901        13.33
     280.319     0.937500        10035        16.00
     292.863     0.943750        10101        17.78
     308.223     0.950000        10169        20.00
     324.607     0.956250        10235        22.86
     344.319     0.962500        10303        26.67
     368.127     0.968750        10369        32.00
     379.903     0.971875        10404        35.56
     398.335     0.975000        10436        40.00
     414.975     0.978125        10469        45.71
     430.335     0.981250        10503        53.33
     456.191     0.984375        10536        64.00
     475.647     0.985938        10553        71.11
     485.887     0.987500        10572        80.00
     502.015     0.989062        10586        91.43
     521.727     0.990625        10603       106.67
     546.303     0.992188        10620       128.00
     557.055     0.992969        10628       142.22
     579.071     0.993750        10638       160.00
     590.847     0.994531        10645       182.86
     604.159     0.995313        10653       213.33
     625.663     0.996094        10662       256.00
     633.855     0.996484        10666       284.44
     646.655     0.996875        10670       320.00
     656.895     0.997266        10674       365.71
     671.743     0.997656        10679       426.67
     707.583     0.998047        10683       512.00
     748.031     0.998242        10685       568.89
     761.343     0.998437        10687       640.00
     819.711     0.998633        10689       731.43
     852.991     0.998828        10691       853.33
     858.623     0.999023        10693      1024.00
     878.591     0.999121        10694      1137.78
     880.127     0.999219        10695      1280.00
     882.687     0.999316        10696      1462.86
     897.535     0.999414        10697      1706.67
     902.655     0.999512        10698      2048.00
     920.575     0.999561        10699      2275.56
     920.575     0.999609        10699      2560.00
     956.415     0.999658        10700      2925.71
     956.415     0.999707        10700      3413.33
     963.583     0.999756        10701      4096.00
     963.583     0.999780        10701      4551.11
     963.583     0.999805        10701      5120.00
     969.215     0.999829        10702      5851.43
     969.215     0.999854        10702      6826.67
     969.215     0.999878        10702      8192.00
     969.215     0.999890        10702      9102.22
     969.215     0.999902        10702     10240.00
    1223.679     0.999915        10703     11702.86
    1223.679     1.000000        10703          inf
#[Mean    =       67.846, StdDeviation   =      115.317]
#[Max     =     1222.656, Total count    =        10703]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10705 requests in 10.00s, 3.64MB read
  Non-2xx or 3xx responses: 10705
Requests/sec:   1070.50
Transfer/sec:    373.21KB